<?php

namespace Database\Seeders;

use App\Models\MilitaryBranch;
use App\Models\Rank;
use Illuminate\Database\Seeder;

class RankSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            'Сухопутні війська Збройних сил України' => [
                'Солдат',
                'Старший солдат',
                'Молодший сержант',
                'Сержант',
                'Старший сержант',
                'Головний сержант',
                'Штаб-сержант',
                'Майстер-сержант',
                'Старший майстер-сержант',
                'Головний майстер-сержант',
                'Молодший лейтенант',
                'Лейтенант',
                'Старший лейтенант',
                'Капітан',
                'Майор',
                'Підполковник',
                'Бригадний генерал',
                'Полковник',
                'Генерал-майор',
                'Генерал-лейтенант',
                'Генерал',
            ],
            'Військово-морські сили Збройних сил України' => [
                'Рекрут',
                'Матрос',
                'Старший матрос',
                'Старшина 2 статті',
                'Старшина 1 статті',
                'Головний старшина',
                'Головний корабельний старшина',
                'Штаб-старшина',
                'Майстер-старшина',
                'Старший майстер-старшина',
                'Головний майстер-старшина',
                'Молодший лейтенант',
                'Лейтенант',
                'Старший лейтенант',
                'Капітан лейтенант',
                'Капітан 3 рангу',
                'Капітан 2 рангу',
                'Капітан 1 рангу',
                'Коммодор',
                'Контрадмірал',
                'Віцеадмірал',
                'Адмірал',
            ],
        ];

        foreach ($data as $branchName => $ranks) {

            $branchId = MilitaryBranch::select('id')->where('name', $branchName)->first()->id;

            foreach ($ranks as $rankName) {
                Rank::create([
                    'name' => $rankName,
                    'military_branch_id' => $branchId,
                ]);
            }

        }
    }
}
